# GetExternallyTaggedGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..GetExternallyTaggedGeometry Method
DirectShapeType Class See Also
---
Gets the externally tagged geometry by its external ID that is stored in this DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ExternallyTaggedGeometryObject GetExternallyTaggedGeometry(
	ExternalGeometryId externalId
)
```

Visual Basic
---
```text
Public Function GetExternallyTaggedGeometry ( _
	externalId As ExternalGeometryId _
) As ExternallyTaggedGeometryObject
```

Visual C++
---
```text
public:
ExternallyTaggedGeometryObject^ GetExternallyTaggedGeometry(
	ExternalGeometryId^ externalId
)
```

# ### Parameters
externalId
    Type: Autodesk.Revit.DB..::..ExternalGeometryId The external ID of the externally tagged geometry that should be obtained.
# ### Return Value
The externally tagged geometry. Or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no such externally tagged geometry in the DirectShapeType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace